docs/performance/raw/20260926-a058-329/t12p20-browse400/k6-warmup.txt


  █ THRESHOLDS 

    http_req_duration{name:confirm}
    ✓ 'p(95)<600000' p(95)=5.05s

    http_req_duration{name:webhook}
    ✓ 'p(95)<600000' p(95)=17.14ms


  █ TOTAL RESULTS 

    checks_total.......: 1       0.051527/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ login 200

    CUSTOM
    browse_2xx.....................: 751    38.6965/s
    browse_ms......................: avg=30.33ms  min=5.77ms  med=16.06ms max=163.68ms p(90)=77.14ms p(95)=91.5ms 
    webhook_ms.....................: avg=9.1ms    min=4.94ms  med=7.51ms  max=57.77ms  p(90)=13.2ms  p(95)=17.14ms
    webhook_over_10s...............: 0.00%  0 out of 75

    HTTP
    http_req_duration..............: avg=559.9ms  min=4.94ms  med=15.55ms max=5.14s    p(90)=5.03s   p(95)=5.04s  
      { expected_response:true }...: avg=574.47ms min=4.94ms  med=15.15ms max=5.14s    p(90)=5.03s   p(95)=5.04s  
      { name:confirm }.............: avg=4.04s    min=18.11ms med=5.03s   max=5.14s    p(90)=5.05s   p(95)=5.05s  
      { name:webhook }.............: avg=9.1ms    min=4.94ms  med=7.51ms  max=57.77ms  p(90)=13.2ms  p(95)=17.14ms
    http_req_failed................: 2.66%  30 out of 1127
    http_reqs......................: 1127   58.070513/s

    EXECUTION
    iteration_duration.............: avg=646.73ms min=5.07ms  med=17.53ms max=5.19s    p(90)=5.04s   p(95)=5.05s  
    iterations.....................: 976    50.289992/s
    vus............................: 5      min=5          max=43 
    vus_max........................: 540    min=540        max=540

    NETWORK
    data_received..................: 3.6 MB 184 kB/s
    data_sent......................: 264 kB 14 kB/s